---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarAlignmentOptions
source: html/db31429e-1890-18b1-d6bf-63163f6cd958.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarAlignmentOptions Property

"Bar Alignment"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarAlignmentOptions { get; }
```